;-*- mode: Org; fill-column: 110;-*-
* users
#+begin_src python :results output :exports both :session s1
import numpy as np
import pandas as pd

def csv_file_read(p):
    df = pd.read_csv(p, index_col=False, low_memory=False)
    return df

p = '/home/u/proj_dolgoletie/users.csv'
df = csv_file_read(p)
print(df.describe().to_string())
df.set_index(df.columns[0], inplace=True)
print(df.describe().to_string())
#+end_src

#+RESULTS:
#+begin_example
       уникальный номер
count      5.233400e+04
mean       1.013990e+08
std        3.020764e+04
min        1.013465e+08
25%        1.013730e+08
50%        1.013990e+08
75%        1.014253e+08
max        1.014512e+08
       дата создание личного дела      пол дата рождения                                 адрес проживания
count                       52334    52334         52334                                            52334
unique                      52270        2         11013                                            33337
top       2019-03-06 00:00:00.000  Женщина    1957-01-01  город москва, каширское шоссе, дом 59, корпус 1
freq                            3    47181            28                                               15
#+end_example

#+name: wt
#+header: :prologue from tabulate import tabulate
#+begin_src python :results value raw :exports both :session s1
def pd2org(df_to_table):
    return tabulate(df_to_table, headers=df_to_table.columns, tablefmt='orgtbl')

pd2org(df.head())
#+end_src

#+RESULTS: wt
|           | направление 1         | направление 2 | направление 3 | адрес площадки                                                                                                                                                                                                                                 | округ площадки                                                                                                                                                      | район площадки                                                                                                                                                                                    | расписание в активных периодах | расписание в закрытых периодах                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                               | расписание в плановом периоде |
|-----------+-----------------------+---------------+---------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------+---------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+--------------------------------+--------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------|
| 801357270 | Физическая активность | ОФП           | ОФП           | город Москва, Саратовская улица, дом 16, корпус 2                                                                                                                                                                                              | Юго-Восточный административный округ                                                                                                                                | муниципальный округ Текстильщики                                                                                                                                                                  |                            nan | c 01.01.2023 по 31.03.2023, Пн., Ср. 19:10-20:10, без перерыва; c 18.04.2022 по 31.12.2022, Пн., Ср. 19:10-20:10, без перерыва; c 20.09.2019 по 31.12.2019, Пн., Ср. 19:00-20:00, без перерыва; c 13.01.2020 по 14.02.2020, Пн., Ср. 19:00-20:00, без перерыва; c 15.02.2020 по 31.12.2020, Пн., Ср. 19:30-20:30, без перерыва                                                                                                                                                                                                                                                                                                                                                                                                                                                                               |                           nan |
| 801356857 | Физическая активность | ОФП           | ОФП           | город Москва, Подольская улица, дом 5                                                                                                                                                                                                          | Юго-Восточный административный округ                                                                                                                                | муниципальный округ Марьино                                                                                                                                                                       |                            nan | c 09.01.2023 по 31.03.2023, Вт., Чт. 10:00-11:00, без перерыва; c 18.10.2022 по 31.12.2022, Вт., Чт. 10:00-11:00, без перерыва; c 05.04.2022 по 17.10.2022, Чт. 11:00-12:00, без перерыва, Вт. 10:00-11:00, без перерыва; c 11.01.2021 по 31.12.2021, Вт., Чт. 12:00-13:00, без перерыва; c 10.09.2019 по 31.12.2019, Вт., Чт. 12:00-13:00, без перерыва; c 14.01.2020 по 31.12.2020, Вт., Чт. 12:00-13:00, без перерыва                                                                                                                                                                                                                                                                                                                                                                                     |                           nan |
| 801351684 | Физическая активность | ОФП           | ОФП           | г. Москва, Базовская улица, дом 15, строение 13, город Москва, Ангарская улица, дом 22А, г. Москва, Талдомская улица, дом 13, корпус А, город Москва, Базовская улица, дом 20А, строение 2, город Москва, Базовская улица, дом 20А, строение 2 | Северный административный округ, Северный административный округ, Северный административный округ, Северный административный округ, Северный административный округ | муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино |                            nan | c 09.01.2023 по 31.03.2023, Вт., Чт. 19:00-20:00, без перерыва; c 06.10.2022 по 31.12.2022, Вт., Чт. 19:00-20:00, без перерыва; c 02.09.2022 по 05.10.2022, Вт., Чт. 18:30-19:30, без перерыва; c 10.01.2022 по 01.09.2022, Пн., Ср. 13:30-14:30, без перерыва; c 22.11.2021 по 31.12.2021, Пн., Ср. 13:30-14:30, без перерыва; c 12.08.2021 по 21.11.2021, Пн., Ср. 15:30-16:30, без перерыва; c 11.01.2021 по 11.08.2021, Пн., Ср. 16:00-17:00, без перерыва; c 04.09.2019 по 31.12.2019, Ср. 19:00-20:00, без перерыва, Пт. 18:00-19:00, без перерыва; c 13.01.2020 по 13.02.2020, Ср. 19:00-20:00, без перерыва, Пт. 18:00-19:00, без перерыва; c 14.02.2020 по 09.08.2020, Ср. 19:00-20:00, без перерыва, Пт. 18:00-19:00, без перерыва; c 10.08.2020 по 31.12.2020, Пн., Ср. 16:00-17:00, без перерыва |                           nan |
| 801353683 | Физическая активность | ОФП           | ОФП           | город Москва, улица Обручева, дом 28А, город Москва, улица Обручева, дом 28А                                                                                                                                                                   | Юго-Западный административный округ, Юго-Западный административный округ                                                                                            | муниципальный округ Обручевский, муниципальный округ Обручевский                                                                                                                                  |                            nan | c 09.01.2023 по 31.03.2023, Пн., Ср. 13:30-14:30, без перерыва; c 17.03.2022 по 23.09.2022, Чт. 16:30-17:30, без перерыва; c 21.03.2022 по 23.09.2022, Пн. 15:30-16:30, без перерыва; c 26.09.2022 по 31.12.2022, Пн., Ср. 13:30-14:30, без перерыва; c 01.10.2020 по 31.12.2020, Пн., Ср. 15:30-16:30, без перерыва; c 13.01.2020 по 30.09.2020, Пн., Ср. 15:30-16:30, без перерыва; c 16.09.2019 по 31.12.2019, Пн., Ср. 15:30-16:30, без перерыва                                                                                                                                                                                                                                                                                                                                                         |                           nan |
| 801352164 | Физическая активность | ОФП           | ОФП           | город Москва, Воронцовский парк, дом 3, город Москва, Воронцовский парк, дом 3                                                                                                                                                                 | Юго-Западный административный округ, Юго-Западный административный округ                                                                                            | муниципальный округ Обручевский, муниципальный округ Обручевский                                                                                                                                  |                            nan | c 10.01.2023 по 28.02.2023, Вт., Пт. 12:00-13:00, без перерыва; c 02.09.2022 по 31.12.2022, Вт., Пт. 12:00-13:00, без перерыва; c 03.06.2022 по 31.08.2022, Вт., Чт. 11:00-12:00, без перерыва; c 05.04.2022 по 03.06.2022, Вт., Чт. 10:00-11:00, без перерыва; c 11.01.2022 по 04.04.2022, Вт., Чт. 11:00-12:00, без перерыва; c 01.09.2021 по 31.12.2021, Вт., Чт. 11:00-12:00, без перерыва; c 03.08.2021 по 31.08.2021, Вт., Чт. 12:00-13:00, без перерыва; c 04.02.2019 по 31.12.2019, Пн., Чт. 10:00-11:00, без перерыва; c 13.01.2020 по 22.07.2020, Пн., Чт. 10:00-11:00, без перерыва; c 01.08.2020 по 31.12.2020, Пн., Чт. 10:00-11:00, без перерыва                                                                                                                                               |                           nan |

#+RESULTS:

# #+begin_src python :results file graphics :exports both :file ./autoimgs/users_scat.png :session s1
# import matplotlib.pyplot as plt
# fig = plt.figure(figsize=(9, 2))
# ax1 = fig.add_subplot(141) # matplotlib.axes._subplots.AxesSubplot
# ax2 = fig.add_subplot(142)
# ax3 = fig.add_subplot(143)
# ax1.boxplot(df['acidity'])
# ax1.set_title('acidity')
# plt.savefig('./autoimgs/users_scat.png')
# #+end_src

* groups
#+begin_src python :results output :exports both :session s1
import numpy as np
import pandas as pd

def csv_file_read(p):
    df = pd.read_csv(p, index_col=False, low_memory=False)
    return df

p = '/home/u/proj_dolgoletie/groups.csv'
df = csv_file_read(p)
print(df.describe().to_string())
df.set_index(df.columns[0], inplace=True)
print(df.describe().to_string())
#+end_src

#+RESULTS:
#+begin_example
       уникальный номер
count      2.700300e+04
mean       8.013602e+08
std        7.885366e+03
min        8.013465e+08
25%        8.013533e+08
50%        8.013602e+08
75%        8.013670e+08
max        8.013739e+08
       направление 1 направление 2                   направление 3                                             адрес площадки                    округ площадки               район площадки                                  расписание в активных периодах                                  расписание в закрытых периодах                              расписание в плановом периоде
count          27003         27003                           27003                                                      27003                             23021                        23021                                                            6522                                                           21643                                                         67
unique            12            81                             456                                                       4821                               139                          685                                                            4458                                                           19959                                                         62
top      Образование    Гимнастика  Осваиваем мобильные устройства  г. Москва, поселение Сосенское, деревня Зименки, дом. 13.  Восточный административный округ  муниципальный округ Ясенево  c 09.01.2023 по 31.12.2023, Пн., Ср. 09:00-10:00, без перерыва  c 11.01.2022 по 31.12.2022, Вт., Чт. 09:00-10:00, без перерыва  c 29.04.2023 по 30.04.2023, Вс. 11:00-12:00, без перерыва
freq            9502          3048                             890                                                        412                              2915                          449                                                              35                                                              18                                                          3
#+end_example

#+name: wt2
#+header: :prologue from tabulate import tabulate
#+begin_src python :results value raw :exports both :session s1
def pd2org(df_to_table):
    return tabulate(df_to_table, headers=df_to_table.columns, tablefmt='orgtbl')

pd2org(df.sample(7))
#+end_src

#+RESULTS: wt2
|           | направление 1                   | направление 2                    | направление 3                 | адрес площадки                                               | округ площадки                                    | район площадки                    | расписание в активных периодах                                                                                       | расписание в закрытых периодах                                                                                                                                                                 | расписание в плановом периоде |
|-----------+---------------------------------+----------------------------------+-------------------------------+--------------------------------------------------------------+---------------------------------------------------+-----------------------------------+----------------------------------------------------------------------------------------------------------------------+------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------------+-------------------------------|
| 801364538 | Физическая активность           | ГТО                              | ГТО                           | г. Москва, 3-я улица Марьиной Рощи, дом 8                    | Северо-Восточный административный округ           | муниципальный округ Марьина Роща  | c 09.01.2023 по 31.12.2023, Чт. 11:00-12:00, без перерыва, Пн. 10:00-11:00, без перерыва                             | nan                                                                                                                                                                                            |                           nan |
| 801362190 | Физическая активность           | Гимнастика                       | Йога                          | г. Москва, Зеленоградская улица, дом 33, корпус А            | Северный административный округ                   | муниципальный округ Ховрино       | nan                                                                                                                  | c 10.01.2023 по 28.02.2023, Вт., Чт. 10:00-11:00, без перерыва; c 06.09.2022 по 31.12.2022, Вт., Чт. 10:00-11:00, без перерыва; c 05.07.2022 по 05.09.2022, Вт., Чт. 10:00-11:00, без перерыва |                           nan |
| 801371112 | Образование                     | ОНЛАЙН Психология и коммуникации | ОНЛАЙН Искусство коммуникаций | г.Москва, ул. Дубнинская, д. 26А, техн.эт. 0, пом. 1, ком. 1 | nan                                               | nan                               | c 24.02.2023 по 30.04.2023, Сб. 12:15-14:15, без перерыва                                                            | c 06.01.2023 по 23.02.2023, Пт. 09:45-11:45, без перерыва                                                                                                                                      |                           nan |
| 801351584 | Образование                     | ОНЛАЙН Иностранные языки         | ОНЛАЙН Итальянский язык       | г.Москва, ул. Дубнинская, д. 26А, техн.эт. 0, пом. 1, ком. 1 | nan                                               | nan                               | nan                                                                                                                  | c 11.01.2022 по 31.12.2022, Вт. 14:30-15:30, без перерыва, Ср. 12:15-13:15, без перерыва                                                                                                       |                           nan |
| 801368808 | Спецпроект / Московский театрал | Московский театрал               | Московский театрал            | город Москва, город Щербинка, Театральная улица, дом 1А      | Троицкий и Новомосковский административные округа | городской округ Щербинка          | c 09.01.2023 по 28.12.2023, Пн. 12:00-14:00, без перерыва; c 09.01.2023 по 28.12.2023, Чт. 14:30-16:30, без перерыва | nan                                                                                                                                                                                            |                           nan |
| 801366489 | Рисование                       | Рисование                        | ИЗО                           | город Москва, Пятницкая улица, дом 46, строение 3            | Центральный административный округ                | муниципальный округ Замоскворечье | nan                                                                                                                  | c 09.01.2023 по 31.03.2023, Ср. 16:30-18:30, без перерыва                                                                                                                                      |                           nan |
| 801363272 | Физическая активность           | Гимнастика                       | Суставная гимнастика          | г. Москва, улица Рословка, дом 5                             | Северо-Западный административный округ            | муниципальный округ Митино        | c 04.01.2023 по 31.12.2023, Ср., Пт. 15:00-16:00, без перерыва                                                       | nan                                                                                                                                                                                            |                           nan |

* attend
#+begin_src python :results output :exports both :session s1
import numpy as np
import pandas as pd

def csv_file_read(p):
    df = pd.read_csv(p, index_col=False, low_memory=False)
    return df

p = '/home/u/proj_dolgoletie/attend.csv'
df = csv_file_read(p)
print(df.describe().to_string())
# df.set_index(df.columns[0], inplace=True)
# print(df.describe().to_string())
#+end_src

#+RESULTS:
:        уникальный номер занятия  уникальный номер группы  уникальный номер участника
: count              5.901274e+06             5.901274e+06                5.901274e+06
: mean               4.017303e+08             8.013542e+08                1.013913e+08
: std                2.363223e+05             7.097297e+03                2.703652e+04
: min                4.013466e+08             8.013465e+08                1.013465e+08
: 25%                4.015109e+08             8.013489e+08                1.013676e+08
: 50%                4.017740e+08             8.013515e+08                1.013901e+08
: 75%                4.019486e+08             8.013579e+08                1.014152e+08
: max                4.021031e+08             8.013739e+08                1.014495e+08

#+begin_src python :results output :exports both :session s1
cols = df.select_dtypes(include="object").columns.tolist()
print(df[cols].describe().to_string())
#+end_src

#+RESULTS:
:             направление 2                                            направление 3 онлайн/офлайн дата занятия время начала занятия время окончания занятия
: count             5901274                                                  5901274       5901274      5901274              5901274                 5901274
: unique                 81                                                      453             2          333                  157                     156
: top     ОНЛАЙН Гимнастика  ОНЛАЙН Мастер-класс по уходу за кожей в зрелом возрасте            Да   2023-02-14             10:00:00                11:00:00
: freq               819496                                                   413095       3816929        39308               658684                  599741

#+name: attend
#+header: :prologue from tabulate import tabulate
#+begin_src python :results value raw :exports both :session s1
def pd2org(df_to_table):
    return tabulate(df_to_table, headers=df_to_table.columns, tablefmt='orgtbl')

pd2org(df.head())
#+end_src

#+RESULTS: attend
|   | уникальный номер занятия | уникальный номер группы | уникальный номер участника | направление 2     | направление 3 | онлайн/офлайн | дата занятия | время начала занятия | время окончания занятия |
|---+--------------------------+-------------------------+----------------------------+-------------------+---------------+---------------+--------------+----------------------+-------------------------|
| 0 |                401346550 |               801346550 |                  101352023 | ОНЛАЙН Гимнастика | ОНЛАЙН Цигун  | Да            |   2022-08-01 |             09:00:00 |                10:00:00 |
| 1 |                401346550 |               801346550 |                  101385462 | ОНЛАЙН Гимнастика | ОНЛАЙН Цигун  | Да            |   2022-08-01 |             09:00:00 |                10:00:00 |
| 2 |                401346550 |               801346550 |                  101421897 | ОНЛАЙН Гимнастика | ОНЛАЙН Цигун  | Да            |   2022-08-01 |             09:00:00 |                10:00:00 |
| 3 |                401346550 |               801346550 |                  101354499 | ОНЛАЙН Гимнастика | ОНЛАЙН Цигун  | Да            |   2022-08-01 |             09:00:00 |                10:00:00 |
| 4 |                401346550 |               801346550 |                  101421312 | ОНЛАЙН Гимнастика | ОНЛАЙН Цигун  | Да            |   2022-08-01 |             09:00:00 |                10:00:00 |

* dict
#+begin_src python :results output :exports both :session s1
import numpy as np
import pandas as pd

def csv_file_read(p):
    df = pd.read_csv(p, index_col=False, low_memory=False)
    return df

p = '/home/u/proj_dolgoletie/dict.csv'
df = csv_file_read(p)
print(df.describe().to_string())
# df.set_index(df.columns[0], inplace=True)
# print(df.describe().to_string())
#+end_src

#+RESULTS:
:          id_level1    id_level2    id_level3  d_level2  d_level3
: count   899.000000   899.000000   899.000000       0.0       0.0
: mean   1013.157953  1096.121246  1207.208009       NaN       NaN
: std     425.207139   335.171900   496.859270       NaN       NaN
: min     589.000000   588.000000   101.000000       NaN       NaN
: 25%     627.000000   650.000000  1097.500000       NaN       NaN
: 50%     649.000000  1076.000000  1329.000000       NaN       NaN
: 75%    1476.000000  1479.000000  1583.500000       NaN       NaN
: max    1731.000000  1794.000000  1814.000000       NaN       NaN

#+begin_src python :results output :exports both :session s1
cols = df.select_dtypes(include="object").columns.tolist()
print(df[cols].describe().to_string())
#+end_src

#+RESULTS:
:        Разметка: Для ума/ Для души / Для тела                              level1                               level2                      leve3                                                                                    d_level1
: count                                     899                                 899                                  899                        899                                                                                         899
: unique                                      3                                  11                                   83                        872                                                                                         720
: top                                   Для ума  Спецпроект / Интеллектуальный клуб  Художественно-прикладное творчество  ОНЛАЙН Ландшафтный дизайн  Занятия по изучению лексики и грамматики английского языка с помощью чтения и аудирования.
: freq                                      511                                 405                                   30                          2                                                                                           4

#+name: dict
#+header: :prologue from tabulate import tabulate
#+begin_src python :results value raw :exports both :session s1
def pd2org(df_to_table):
    return tabulate(df_to_table, headers=df_to_table.columns, tablefmt='orgtbl')

pd2org(df.sample(7))
#+end_src

#+RESULTS: dict
|     | уникальный номер участника | уникальный номер группы |
|-----+----------------------------+-------------------------|
|  27 |                1.01359e+08 |                     nan |
| 144 |                1.01418e+08 |                     nan |
|  46 |                1.01365e+08 |                     nan |
|  80 |                1.01378e+08 |                     nan |
| 109 |                1.01397e+08 |                     nan |
|  96 |                1.01386e+08 |                     nan |
| 170 |                 1.0143e+08 |                     nan |

* test
#+begin_src python :results output :exports both :session s1
import numpy as np
import pandas as pd

def csv_file_read(p):
    df = pd.read_csv(p, index_col=False, low_memory=False)
    return df

p = '/home/u/proj_dolgoletie/test.csv'
df = csv_file_read(p)
print(df.describe().to_string())
# df.set_index(df.columns[0], inplace=True)
# print(df.describe().to_string())
print(df.sample(7))
#+end_src

#+RESULTS:
#+begin_example
       уникальный номер участника  уникальный номер группы
count                2.000000e+02                      0.0
mean                 1.013928e+08                      NaN
std                  2.944838e+04                      NaN
min                  1.013466e+08                      NaN
25%                  1.013675e+08                      NaN
50%                  1.013893e+08                      NaN
75%                  1.014192e+08                      NaN
max                  1.014496e+08                      NaN
     уникальный номер участника  уникальный номер группы
95                    101386351                      NaN
24                    101358634                      NaN
167                   101427987                      NaN
89                    101384297                      NaN
61                    101369418                      NaN
48                    101366727                      NaN
81                    101379470                      NaN
#+end_example

* annend->(groups, users)
#+begin_src python :results output :exports both :session s1
import numpy as np
import pandas as pd

p = '/home/u/proj_dolgoletie/groups.csv'
dfg = pd.read_csv(p, index_col=False, low_memory=False)
                  # names=['id', 'dict1', 'dict2', 'dict3', 'p_addr', 'p_okr', 'p_ra', 'shed', 'as'])
# p = '/home/u/proj_dolgoletie/users.csv'
# dfu = pd.read_csv(p, index_col=False, low_memory=False, names=['id', 'created', 'gender', 'birthday', 'address'])

print(dfg.head().to_string())
# print(df.describe().to_string())
# df.set_index(df.columns[0], inplace=True)
# print(df.describe().to_string())
#+end_src

#+RESULTS:
:    уникальный номер          направление 1 направление 2 направление 3                                                                                                                                                                                                                                  адрес площадки                                                                                                                                                       округ площадки                                                                                                                                                                                     район площадки расписание в активных периодах                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                                расписание в закрытых периодах расписание в плановом периоде
: 0         801357270  Физическая активность           ОФП           ОФП                                                                                                                                                                                               город Москва, Саратовская улица, дом 16, корпус 2                                                                                                                                 Юго-Восточный административный округ                                                                                                                                                                   муниципальный округ Текстильщики                            NaN                                                                                                                                                                                                                                                                                                                                                                                                                                                                                c 01.01.2023 по 31.03.2023, Пн., Ср. 19:10-20:10, без перерыва; c 18.04.2022 по 31.12.2022, Пн., Ср. 19:10-20:10, без перерыва; c 20.09.2019 по 31.12.2019, Пн., Ср. 19:00-20:00, без перерыва; c 13.01.2020 по 14.02.2020, Пн., Ср. 19:00-20:00, без перерыва; c 15.02.2020 по 31.12.2020, Пн., Ср. 19:30-20:30, без перерыва                           NaN
: 1         801356857  Физическая активность           ОФП           ОФП                                                                                                                                                                                                           город Москва, Подольская улица, дом 5                                                                                                                                 Юго-Восточный административный округ                                                                                                                                                                        муниципальный округ Марьино                            NaN                                                                                                                                                                                                                                                                                                                                                                                      c 09.01.2023 по 31.03.2023, Вт., Чт. 10:00-11:00, без перерыва; c 18.10.2022 по 31.12.2022, Вт., Чт. 10:00-11:00, без перерыва; c 05.04.2022 по 17.10.2022, Чт. 11:00-12:00, без перерыва, Вт. 10:00-11:00, без перерыва; c 11.01.2021 по 31.12.2021, Вт., Чт. 12:00-13:00, без перерыва; c 10.09.2019 по 31.12.2019, Вт., Чт. 12:00-13:00, без перерыва; c 14.01.2020 по 31.12.2020, Вт., Чт. 12:00-13:00, без перерыва                           NaN
: 2         801351684  Физическая активность           ОФП           ОФП  г. Москва, Базовская улица, дом 15, строение 13, город Москва, Ангарская улица, дом 22А, г. Москва, Талдомская улица, дом 13, корпус А, город Москва, Базовская улица, дом 20А, строение 2, город Москва, Базовская улица, дом 20А, строение 2  Северный административный округ, Северный административный округ, Северный административный округ, Северный административный округ, Северный административный округ  муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино, муниципальный округ Западное Дегунино                            NaN  c 09.01.2023 по 31.03.2023, Вт., Чт. 19:00-20:00, без перерыва; c 06.10.2022 по 31.12.2022, Вт., Чт. 19:00-20:00, без перерыва; c 02.09.2022 по 05.10.2022, Вт., Чт. 18:30-19:30, без перерыва; c 10.01.2022 по 01.09.2022, Пн., Ср. 13:30-14:30, без перерыва; c 22.11.2021 по 31.12.2021, Пн., Ср. 13:30-14:30, без перерыва; c 12.08.2021 по 21.11.2021, Пн., Ср. 15:30-16:30, без перерыва; c 11.01.2021 по 11.08.2021, Пн., Ср. 16:00-17:00, без перерыва; c 04.09.2019 по 31.12.2019, Ср. 19:00-20:00, без перерыва, Пт. 18:00-19:00, без перерыва; c 13.01.2020 по 13.02.2020, Ср. 19:00-20:00, без перерыва, Пт. 18:00-19:00, без перерыва; c 14.02.2020 по 09.08.2020, Ср. 19:00-20:00, без перерыва, Пт. 18:00-19:00, без перерыва; c 10.08.2020 по 31.12.2020, Пн., Ср. 16:00-17:00, без перерыва                           NaN
: 3         801353683  Физическая активность           ОФП           ОФП                                                                                                                                                                    город Москва, улица Обручева, дом 28А, город Москва, улица Обручева, дом 28А                                                                                             Юго-Западный административный округ, Юго-Западный административный округ                                                                                                                                   муниципальный округ Обручевский, муниципальный округ Обручевский                            NaN                                                                                                                                                                                                                                                                                                                                                          c 09.01.2023 по 31.03.2023, Пн., Ср. 13:30-14:30, без перерыва; c 17.03.2022 по 23.09.2022, Чт. 16:30-17:30, без перерыва; c 21.03.2022 по 23.09.2022, Пн. 15:30-16:30, без перерыва; c 26.09.2022 по 31.12.2022, Пн., Ср. 13:30-14:30, без перерыва; c 01.10.2020 по 31.12.2020, Пн., Ср. 15:30-16:30, без перерыва; c 13.01.2020 по 30.09.2020, Пн., Ср. 15:30-16:30, без перерыва; c 16.09.2019 по 31.12.2019, Пн., Ср. 15:30-16:30, без перерыва                           NaN
: 4         801352164  Физическая активность           ОФП           ОФП                                                                                                                                                                  город Москва, Воронцовский парк, дом 3, город Москва, Воронцовский парк, дом 3                                                                                             Юго-Западный административный округ, Юго-Западный административный округ                                                                                                                                   муниципальный округ Обручевский, муниципальный округ Обручевский                            NaN                                                                                                                                                c 10.01.2023 по 28.02.2023, Вт., Пт. 12:00-13:00, без перерыва; c 02.09.2022 по 31.12.2022, Вт., Пт. 12:00-13:00, без перерыва; c 03.06.2022 по 31.08.2022, Вт., Чт. 11:00-12:00, без перерыва; c 05.04.2022 по 03.06.2022, Вт., Чт. 10:00-11:00, без перерыва; c 11.01.2022 по 04.04.2022, Вт., Чт. 11:00-12:00, без перерыва; c 01.09.2021 по 31.12.2021, Вт., Чт. 11:00-12:00, без перерыва; c 03.08.2021 по 31.08.2021, Вт., Чт. 12:00-13:00, без перерыва; c 04.02.2019 по 31.12.2019, Пн., Чт. 10:00-11:00, без перерыва; c 13.01.2020 по 22.07.2020, Пн., Чт. 10:00-11:00, без перерыва; c 01.08.2020 по 31.12.2020, Пн., Чт. 10:00-11:00, без перерыва                           NaN
